#!/usr/bin/env ruby
#
# Homebrew Bundle file
# - https://github.com/Homebrew/homebrew-bundle
#

# Options
cask_args appdir: '/Applications'

# 'brew tap'
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "rcmdnk/file"


#
# Local Brewfile's
#

Dir.glob(File.expand_path('~/.config/homebrew/Brewfile.*')).each do |file|
  next if file.end_with?('.lock.json')
  instance_eval File.read(file) if File.exists?(file)
end

#
# Only macOS beyond here
#

require 'os'
return unless OS.mac?

# 'brew install'
brew "ack"                            # Search tool like grep, but optimized for programmers
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "python@3.12"
brew "black"
brew "btop"
brew "cheat"
brew "coreutils"
brew "ctop"                           # Top-like interface for container metrics
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "duf"                            # Disk Usage/Free Utility - a better 'df' alternative
brew "dust"                           # More intuitive version of du in rust
brew "eza"
brew "fd"
brew "fzf"                            # fzf is a general-purpose command-line fuzzy finder.
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnu-sed"
brew "gping"
brew "helix"
brew "htop"
brew "hub" 
brew "iperf3" 
brew "jq"
brew "lazygit"
brew "m-cli"
brew "mas" if OS.mac?
brew "neovim"
brew "ollama"
brew "prettyping"
brew "procs"                          # Modern replacement for ps written by Rust
brew "ripgrep"
brew "rsync"
brew "shfmt"
brew "ssh-audit"
brew "starship"
brew "stow"
brew "tealdeer"
brew "thefuck"
brew "tig"
brew "trash"
brew "tree"
brew "wget"
brew "yq"
brew "zenith"                         # In terminal graphical metrics for your *nix system
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# 'brew install --cask'
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "airfoil"
cask "aldente"
cask "appcleaner"
cask "bartender"
cask "bettermouse", greedy: true
cask "brave-browser"
cask "cakebrew"
cask "dash"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "fantastical"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "hazel"
cask "home-assistant"
cask "iina"
cask "keka"
cask "kitty"
cask "little-snitch"
cask "netspot"
cask "notion"
cask "onyx"
cask "postman"
cask "prefs-editor"
cask "prusaslicer"
cask "qlcolorcode", args: { appdir: "/Applications" }
cask "qlimagesize", args: { appdir: "/Applications" }
cask "qlmarkdown", args: { appdir: "/Applications" }
cask "qlstephen", args: { appdir: "/Applications" }
cask "quicklook-csv", args: { appdir: "/Applications" }
cask "quicklook-json", args: { appdir: "/Applications" }
cask "raindropio"
cask "raycast"
cask "sonos"
cask "soundsource"
cask "spotify"
cask "suspicious-package"
cask "todoist"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# 'mas install'
mas "1Password for Safari", id: 1569813296
mas "Airmail", id: 918858936
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Cardhop", id: 1290358394
mas "Discovery", id: 1381004916
mas "Disk Speed Test", id: 425264550
mas "Flighty", id: 1358823008
mas "Hush", id: 1544743900
mas "iStat Menus", id: 1319778037
mas "LogTen", id: 837263884
mas "Magnet", id: 441258766
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pilot Training", id: 1272775528
mas "Privacy.com for Safari", id: 6449850851
mas "Reeder", id: 1529448980
mas "Save to Raindrop.io", id: 1549370672
mas "SSH Config Editor", id: 1109319285
mas "WireGuard", id: 1451685025

# 'whalebrew install'

# 'vscode --install-extension'
vscode "chakrounanas.turbo-console-log"
vscode "codezombiech.gitignore"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "earshinov.simple-alignment"
vscode "ecmel.vscode-html-css"
vscode "foxundermoon.shell-format"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "seatonjiang.gitmoji-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"


