#!/usr/bin/env ruby
#
# Homebrew Bundle file
# - https://github.com/Homebrew/homebrew-bundle
#

# 'brew tap'
tap "buo/cask-upgrade"
tap "homebrew/bundle"
# tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "rcmdnk/file"


brew "ack"  # Search tool like grep, but optimized for programmers
brew "bash"	# Bourne-Again SHell, a UNIX command interpreter
brew "bash-completion@2"	# Programmable completion for Bash 4.2+
brew "bat"	# Clone of cat(1) with syntax highlighting and Git integration
brew "coreutils"	# GNU File, Shell, and Text utilities
brew "duf"	# Disk Usage/Free Utility - a better 'df' alternative
brew "dust"	# More intuitive version of du in rust
brew "eza"	# Modern, maintained replacement for ls
brew "fd"	# Simple, fast and user-friendly alternative to find
brew "fzf"	# Command-line fuzzy finder written in Go
brew "gh"	# GitHub command-line tool
brew "git"	# Distributed revision control system
brew "git-delta"	# Syntax-highlighting pager for git and diff output
brew "git-extras"	# Small git utilities
brew "gnu-sed"	# GNU implementation of the famous stream editor
brew "gping"	# Ping, but with a graph
brew "htop"	# Improved top (interactive process viewer)
brew "jq"	# Lightweight and flexible command-line JSON processor
brew "neovim"	# Ambitious Vim-fork focused on extensibility and agility

brew "procs"	# Modern replacement for ps written by Rust
brew "ripgrep"	# Search tool like grep and The Silver Searcher
brew "rsync"	# Utility that provides fast incremental file transfer
brew "shellcheck" # Shell script analysis tool
brew "shfmt"	# Autoformat shell script source code
brew "ssh-audit"	# SSH server & client auditing
brew "starship"	# Cross-shell prompt for astronauts
brew "stow"	# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "tree"	# Display directories as trees (with optional color/HTML output)
brew "tmux"	# Terminal multiplexer
brew "yq"	# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "wget"	# Internet file retriever
brew "zoxide"	# Shell extension to navigate your filesystem faster
brew "zsh"	# UNIX shell (command interpreter)
brew "zsh-autosuggestions"	# Fish-like fast/unobtrusive autosuggestions for zsh
#brew "zsh-completions"	# Additional completion definitions for zsh
brew "zsh-history-substring-search"	# Zsh port of Fish shell's history search
brew "zsh-syntax-highlighting"	# Fish shell like syntax highlighting for zsh


#
# Local Brewfile's
#

Dir.glob(File.expand_path('~/.config/homebrew/Brewfile.*')).each do |file|
  next if file.end_with?('.lock.json')
  instance_eval File.read(file) if File.exists?(file)
end

#
# Only macOS beyond here
#

require 'os'
return unless OS.mac?

# Options
cask_args appdir: '/Applications'

brew "python"	# Interpreted, interactive, object-oriented programming language
brew "black"	# Python code formatter
brew "node"  # Node.Js Platform built on V8 to build network applications
brew "ctop"	# Top-like interface for container metrics
brew "diff-so-fancy"	# Good-lookin' diffs with diff-highlight and more
brew "difftastic"	# Diff that understands syntax
brew "iperf3"	# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "m-cli"	# Swiss Army Knife for macOS
brew "mas"	# Mac App Store command-line interface
brew "ollama"	# Create, run, and share large language models (LLMs)
brew "prettyping"	# Wrapper to colorize and simplify ping's output
brew "trash"	# CLI tool that moves files or folder to the trash
brew "whalebrew"	# Homebrew, but with Docker images
brew "zenith"	# In terminal graphical metrics for your *nix system

# 'brew install --cask'
cask "1password"	# Password manager that keeps all passwords secure behind one password
cask "1password-cli"	# Command-line interface for 1Password
cask "adobe-creative-cloud"	# Collection of apps and services for photography, design, video, web, and UX
cask "airfoil"	# Sends audio from computer to outputs
cask "aldente"	# Menu bar tool to limit maximum charging percentage
cask "appcleaner"	# Application uninstaller
cask "betterdisplay" # Display management tool
cask "bettermouse"	# Utility improving 3rd party mouse performance and functionalities
cask "brave-browser"	# Web browser focusing on privacy
cask "dash"	# API documentation browser and code snippet manager
cask "dbeaver-community"	# Universal database tool and SQL client
cask "discord"	# Voice and text chat software
cask "docker"	# App to build and share containerised applications and microservices
cask "fantastical"	# Calendar software
cask "fmail2" # Unofficial native application for Fastmail
cask "font-hack-nerd-font"	# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"	# Developer targeted fonts with a high number of glyphs
cask "hazel"	# Automated organisation
cask "home-assistant"	# Companion app for Home Assistant home automation software
cask "iina"	# Free and open-source media player
cask "keka"	# File archiver
cask "kitty"	# GPU-based terminal emulator
cask "little-snitch"	# Host-based application firewall
cask "netspot"	# WiFi site survey software and WiFi scanner
cask "notion"	# App to write, plan, collaborate, and get organised
cask "onyx"	# Verify system files structure, run miscellaneous maintenance and more
cask "postman"	# Collaboration platform for API development
cask "prefs-editor"	# Graphical user interface for the 'defaults' command
cask "prusaslicer"	# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "qlcolorcode"	# Quick Look plug-in that renders source code with syntax highlighting
cask "qlimagesize"	# Display image info and preview unsupported formats in QuickLook
cask "qlmarkdown"	# Quick Look generator for Markdown files
cask "qlstephen"	# Quick Look plugin for plaintext files without an extension
cask "quicklook-csv"	# Quick Look plugin for CSV files
cask "quicklook-json"	# Quick Look plugin for JSON files
cask "raindropio"	# All-in-one bookmark manager
cask "raycast"	# Control your tools with a few keystrokes
cask "slack"	# Team communication and collaboration software
cask "sonos"	# Control your Sonos system
cask "soundsource"	# Sound and audio controller
cask "spotify"	# Music streaming service
cask "suspicious-package"	# Application for inspecting installer packages
cask "tastytrade"	# Desktop trading platform
cask "thinkorswim", greedy: true	# Desktop client for TD Ameritrade trading platform
cask "todoist"	# To-do list
cask "utm"	# Virtual machines UI using QEMU
cask "visual-studio-code"	# Open-source code editor
cask "warp"	# Rust-based terminal
cask "zoom"	# Video communication and virtual meeting platform

# 'mas install'
mas "Airmail", id: 918858936
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Cardhop", id: 1290358394
mas "Discovery", id: 1381004916
mas "Disk Speed Test", id: 425264550
mas "Flighty", id: 1358823008
mas "Hush", id: 1544743900
mas "iStat Menus", id: 1319778037
mas "LogTen", id: 837263884
mas "Magnet", id: 441258766
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pilot Training", id: 1272775528
mas "Privacy.com for Safari", id: 6449850851
mas "Reeder", id: 1529448980
mas "Save to Raindrop.io", id: 1549370672
mas "SSH Config Editor", id: 1109319285
mas "WireGuard", id: 1451685025

# 'whalebrew install'

# 'vscode --install-extension'
# vscode "chakrounanas.turbo-console-log"
# vscode "codezombiech.gitignore"
# vscode "donjayamanne.python-environment-manager"
# vscode "eamodio.gitlens"
# vscode "earshinov.simple-alignment"
# vscode "ecmel.vscode-html-css"
# vscode "foxundermoon.shell-format"
# vscode "kamikillerto.vscode-colorize"
# vscode "kevinrose.vsc-python-indent"
# vscode "mhutchie.git-graph"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.black-formatter"
# vscode "ms-python.debugpy"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode-remote.vscode-remote-extensionpack"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.remote-server"
# vscode "oderwat.indent-rainbow"
# vscode "pranaygp.vscode-css-peek"
# vscode "redhat.vscode-xml"
# vscode "redhat.vscode-yaml"
# vscode "rogalmic.bash-debug"
# vscode "seatonjiang.gitmoji-vscode"
# vscode "tamasfe.even-better-toml"
# vscode "timonwong.shellcheck"
# vscode "vivaxy.vscode-conventional-commits"
# vscode "vscode-icons-team.vscode-icons"
# vscode "wayou.vscode-todo-highlight"
# vscode "xabikos.javascriptsnippets"
# vscode "zhuangtongfa.material-theme"


